# ConnectionValidationInfo Class

---
This object contains information about fabrication connection validations.
SystemObject Autodesk.Revit.DBConnectionValidationInfo
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

    public class ConnectionValidationInfo : IDisposable

    Public Class ConnectionValidationInfo
    	Implements IDisposable

    public ref class ConnectionValidationInfo : IDisposable

    type ConnectionValidationInfo =
        class
            interface IDisposable
        end
The ConnectionValidationInfo type exposes the following members.
| Name| Description
---|---|---
| ConnectionValidationInfo|  Constructor.
Top
| Name| Description
---|---|---
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
Top
| Name| Description
---|---|---
| Dispose| Releases all resources used by the ConnectionValidationInfo
| Equals| Determines whether the specified object is equal to the current object.(Inherited from Object)
| GetHashCode| Serves as the default hash function.(Inherited from Object)
| GetType| Gets the Type of the current instance.(Inherited from Object)
| GetWarning|  Access specific warning number of warnings generated by reload.
| IsValidWarningIndex|  Validate warning index.
| ManyWarnings|  Returns number of warnings generated by reload.
| ToString| Returns a string that represents the current object.(Inherited from Object)
Top
#### Reference
Autodesk.Revit.DB Namespace